data/OpenFOAM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          44529;
        startFace       66488;
    }
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          44529;
        startFace       111017;
    }
    exit
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       155546;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       155596;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       155646;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       155696;
    }
    aerofoil
    {
        type            wall;
        physicalType    patch;
        nFaces          411;
        startFace       155746;
    }
)

// ************************************************************************* //
